Revit 2024 API
FileImportedEventArgs Members
The FileImportedEventArgs type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from RevitAPIEventArgs.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCancelled
 Indicates whether the event is being cancelled.
 (Inherited from RevitAPIEventArgs.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
Document
 The document associated with the event.
 (Inherited from RevitAPIPostDocEventArgs.)
Format
 Identifies the import format, e.g. DWG or image.
ImportedInstanceId
 The ElementId of the imported instance that represents the imported object(s) after a successful import. It could be used for further manipulation of that instance.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
Path
 Path of the source file that was imported.
Status
 Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).
 (Inherited from RevitAPIPostEventArgs.)
See Also
FileImportedEventArgs Class
Autodesk.Revit.DB.Events Namespace